; domain
(define (domain deliver)
    (:types CUSTOMER STORE FOOD TRUNK)

    (:predicates 
        (customer ?c)
        (store ?s)
        (food ?f)
        (space ?t)

        (loaded ?t)
        (obj-at ?o1 ?o2)
        (driver-at ?location)
        (order ?c ?s)
        (order-done ?c)        
    )
                  
    (:functions 
        (total-cost)
        (distance ?from ?to)
    )

    (:action pick-up
        :parameters (?f ?s ?t)
        :precondition (and
            (space ?t)
            (not (loaded ?t))

            (store ?s)
            (driver-at ?s)
            (obj-at ?f ?s)
        )
        :effect (and 
            (not (obj-at ?f ?s))
            (obj-at ?f ?t)
            (loaded ?t)
        )
    )

    (:action deliver 
        :parameters (?f ?c ?t)
        :precondition (and
            (space ?t)
            (loaded ?t)

            (customer ?c)
            (driver-at ?c)

            (obj-at ?f ?t)
            (order ?f ?c)
        )
        :effect (and
            (not (obj-at ?f ?t))
            (not (loaded ?t))

            (obj-at ?f ?c)
            (order-done ?f)
        )      
    )

    (:action move 
        :parameters (?from ?to)
        :precondition (and 
            (driver-at ?from) 
            (or (customer ?to) 
                (store ?to) 
            )
        )
        :effect (and
            (increase (total-cost) (distance ?from ?to))
            (not (driver-at ?from))
            (driver-at ?to)
        )
    )
)

; problem
(define (problem problem3)
	(:domain deliver)
	(:objects s0 s1 s2 s3 s4 s5 s6 c1 c2 c3 f0 f1 f2 f3 f4 f5 f6 t0 t1 t2 t3 t4 t5 t6)
	(:init (driver-at c1) (customer c1) (customer c2) (customer c3) (store s0) (store s1) (store s2) (store s3) (store s4) (store s5) (store s6) (food f0) (not (order-done f0)) (food f1) (not (order-done f1)) (food f2) (not (order-done f2)) (food f3) (not (order-done f3)) (food f4) (not (order-done f4)) (food f5) (not (order-done f5)) (food f6) (not (order-done f6)) (space t0) (space t1) (space t2) (space t3) (space t4) (space t5) (space t6) (obj-at f0 s6) (obj-at f1 s6) (obj-at f2 s1) (obj-at f3 s5) (obj-at f4 s4) (obj-at f5 s4) (obj-at f6 s5) (order f0 c1) (order f1 c1) (order f2 c2) (order f3 c2) (order f4 c3) (order f5 c3) (order f6 c3)
	(= (total-cost) 0)
	(= (distance s0 s0) 0)
	(= (distance s0 s1) 7)
	(= (distance s0 s2) 8)
	(= (distance s0 s3) 9)
	(= (distance s0 s4) 8)
	(= (distance s0 s5) 10)
	(= (distance s0 s6) 5)
	(= (distance s0 c1) 7)
	(= (distance s0 c2) 11)
	(= (distance s0 c3) 8)
	(= (distance s1 s0) 7)
	(= (distance s1 s1) 0)
	(= (distance s1 s2) 14)
	(= (distance s1 s3) 4)
	(= (distance s1 s4) 5)
	(= (distance s1 s5) 2)
	(= (distance s1 s6) 9)
	(= (distance s1 c1) 3)
	(= (distance s1 c2) 4)
	(= (distance s1 c3) 4)
	(= (distance s2 s0) 8)
	(= (distance s2 s1) 14)
	(= (distance s2 s2) 0)
	(= (distance s2 s3) 17)
	(= (distance s2 s4) 12)
	(= (distance s2 s5) 16)
	(= (distance s2 s6) 5)
	(= (distance s2 c1) 15)
	(= (distance s2 c2) 17)
	(= (distance s2 c3) 16)
	(= (distance s3 s0) 9)
	(= (distance s3 s1) 4)
	(= (distance s3 s2) 17)
	(= (distance s3 s3) 0)
	(= (distance s3 s4) 9)
	(= (distance s3 s5) 5)
	(= (distance s3 s6) 12)
	(= (distance s3 c1) 2)
	(= (distance s3 c2) 6)
	(= (distance s3 c3) 1)
	(= (distance s4 s0) 8)
	(= (distance s4 s1) 5)
	(= (distance s4 s2) 12)
	(= (distance s4 s3) 9)
	(= (distance s4 s4) 0)
	(= (distance s4 s5) 5)
	(= (distance s4 s6) 7)
	(= (distance s4 c1) 8)
	(= (distance s4 c2) 6)
	(= (distance s4 c3) 9)
	(= (distance s5 s0) 10)
	(= (distance s5 s1) 2)
	(= (distance s5 s2) 16)
	(= (distance s5 s3) 5)
	(= (distance s5 s4) 5)
	(= (distance s5 s5) 0)
	(= (distance s5 s6) 11)
	(= (distance s5 c1) 5)
	(= (distance s5 c2) 1)
	(= (distance s5 c3) 6)
	(= (distance s6 s0) 5)
	(= (distance s6 s1) 9)
	(= (distance s6 s2) 5)
	(= (distance s6 s3) 12)
	(= (distance s6 s4) 7)
	(= (distance s6 s5) 11)
	(= (distance s6 s6) 0)
	(= (distance s6 c1) 10)
	(= (distance s6 c2) 12)
	(= (distance s6 c3) 11)
	(= (distance c1 s0) 7)
	(= (distance c1 s1) 3)
	(= (distance c1 s2) 15)
	(= (distance c1 s3) 2)
	(= (distance c1 s4) 8)
	(= (distance c1 s5) 5)
	(= (distance c1 s6) 10)
	(= (distance c1 c1) 0)
	(= (distance c1 c2) 6)
	(= (distance c1 c3) 1)
	(= (distance c2 s0) 11)
	(= (distance c2 s1) 4)
	(= (distance c2 s2) 17)
	(= (distance c2 s3) 6)
	(= (distance c2 s4) 6)
	(= (distance c2 s5) 1)
	(= (distance c2 s6) 12)
	(= (distance c2 c1) 6)
	(= (distance c2 c2) 0)
	(= (distance c2 c3) 7)
	(= (distance c3 s0) 8)
	(= (distance c3 s1) 4)
	(= (distance c3 s2) 16)
	(= (distance c3 s3) 1)
	(= (distance c3 s4) 9)
	(= (distance c3 s5) 6)
	(= (distance c3 s6) 11)
	(= (distance c3 c1) 1)
	(= (distance c3 c2) 7)
	(= (distance c3 c3) 0)
	)
	(:goal (and (order-done f0) (order-done f1) (order-done f2) (order-done f3) (order-done f4) (order-done f5) (order-done f6)))
	(:metric minimize (total-cost))
)

; plan
1. (move c1 c2)
   deleted: (driver-at c1)
   added: (driver-at c2)
   goals met: 0 of 7
2. (move c2 c3)
   deleted: (driver-at c2)
   added: (driver-at c3)
   goals met: 0 of 7
3. (move c3 s1)
   deleted: (driver-at c3)
   added: (driver-at s1)
   goals met: 0 of 7
4. (pick-up f2 s1 t5)
   deleted: (obj-at f2 s1)
   added: (obj-at f2 t5) (loaded t5)
   goals met: 0 of 7
5. (move s1 c3)
   deleted: (driver-at s1)
   added: (driver-at c3)
   goals met: 0 of 7
6. (move c3 s4)
   deleted: (driver-at c3)
   added: (driver-at s4)
   goals met: 0 of 7
7. (pick-up f5 s4 t4)
   deleted: (obj-at f5 s4)
   added: (obj-at f5 t4) (loaded t4)
   goals met: 0 of 7
8. (move s4 c3)
   deleted: (driver-at s4)
   added: (driver-at c3)
   goals met: 0 of 7
9. (deliver f5 c3 t4)
   deleted: (obj-at f5 t4) (loaded t4)
   added: (obj-at f5 c3) (order-done f5)
   goals met: 1 of 7
10. (move c3 s4)
   deleted: (driver-at c3)
   added: (driver-at s4)
   goals met: 1 of 7
11. (pick-up f4 s4 t6)
   deleted: (obj-at f4 s4)
   added: (obj-at f4 t6) (loaded t6)
   goals met: 1 of 7
12. (move s4 c3)
   deleted: (driver-at s4)
   added: (driver-at c3)
   goals met: 1 of 7
13. (deliver f4 c3 t6)
   deleted: (obj-at f4 t6) (loaded t6)
   added: (obj-at f4 c3) (order-done f4)
   goals met: 2 of 7
14. (move c3 c2)
   deleted: (driver-at c3)
   added: (driver-at c2)
   goals met: 2 of 7
15. (move c2 s5)
   deleted: (driver-at c2)
   added: (driver-at s5)
   goals met: 2 of 7
16. (pick-up f3 s5 t6)
   deleted: (obj-at f3 s5)
   added: (obj-at f3 t6) (loaded t6)
   goals met: 2 of 7
17. (pick-up f6 s5 t4)
   deleted: (obj-at f6 s5)
   added: (obj-at f6 t4) (loaded t4)
   goals met: 2 of 7
18. (move s5 c2)
   deleted: (driver-at s5)
   added: (driver-at c2)
   goals met: 2 of 7
19. (deliver f2 c2 t5)
   deleted: (obj-at f2 t5) (loaded t5)
   added: (obj-at f2 c2) (order-done f2)
   goals met: 3 of 7
20. (deliver f3 c2 t6)
   deleted: (obj-at f3 t6) (loaded t6)
   added: (obj-at f3 c2) (order-done f3)
   goals met: 4 of 7
21. (move c2 c1)
   deleted: (driver-at c2)
   added: (driver-at c1)
   goals met: 4 of 7
22. (move c1 s6)
   deleted: (driver-at c1)
   added: (driver-at s6)
   goals met: 4 of 7
23. (pick-up f0 s6 t6)
   deleted: (obj-at f0 s6)
   added: (obj-at f0 t6) (loaded t6)
   goals met: 4 of 7
24. (move s6 c1)
   deleted: (driver-at s6)
   added: (driver-at c1)
   goals met: 4 of 7
25. (deliver f0 c1 t6)
   deleted: (obj-at f0 t6) (loaded t6)
   added: (obj-at f0 c1) (order-done f0)
   goals met: 5 of 7
26. (move c1 s6)
   deleted: (driver-at c1)
   added: (driver-at s6)
   goals met: 5 of 7
27. (pick-up f1 s6 t6)
   deleted: (obj-at f1 s6)
   added: (obj-at f1 t6) (loaded t6)
   goals met: 5 of 7
28. (move s6 c1)
   deleted: (driver-at s6)
   added: (driver-at c1)
   goals met: 5 of 7
29. (deliver f1 c1 t6)
   deleted: (obj-at f1 t6) (loaded t6)
   added: (obj-at f1 c1) (order-done f1)
   goals met: 6 of 7
30. (move c1 c3)
   deleted: (driver-at c1)
   added: (driver-at c3)
   goals met: 6 of 7
31. (deliver f6 c3 t4)
   deleted: (obj-at f6 t4) (loaded t4)
   added: (obj-at f6 c3) (order-done f6)
   goals met: 7 of 7
